<?php

return [
    /*
    |--------------------------------------------------------------------------
    | Моўныя рэсурсы для праверкі значэнняў
    |--------------------------------------------------------------------------
    |
    | Наступныя моўныя радкі ўтрымліваюць паведамленні па-змаўчанні, якія выкарыстоўваюцца
    | класам, правяраючым значэння (валідатары) Некаторыя з правілаў маюць
    | некалькі версій, напрыклад, size. Вы можаце памяняць іх на любыя
    | іншыя, якія лепш падыходзяць для вашай праграмы.
    |
    */

    'accepted'             => 'Вы павінны прыняць :attribute.',
    'active_url'           => 'Поле :attribute утрымлівае несапраўдны URL.',
    'after'                => 'У полі :attribute павінна быць дата пасля :date.',
    'after_or_equal'       => 'У полі :attribute павінна быць дата пасля або роўная :date.',
    'alpha'                => 'Поле :attribute можа мець толькі літары.',
    'alpha_dash'           => 'Поле :attribute можа мець толькі літары, лічбы і злучок.',
    'alpha_num'            => 'Поле :attribute можа мець толькі літары і лічбы.',
    'array'                => 'Поле :attribute павінна быць масівам.',
    'before'               => 'У полі :attribute павінна быць дата да :date.',
    'before_or_equal'      => 'У полі :attribute павінна быць дата да або роўная :date.',
    'between'              => [
        'numeric' => 'Поле :attribute павінна быць паміж :min і :max.',
        'file'    => 'Памер файла ў поле :attribute павінен быць паміж :min і :max кілабайт.',
        'string'  => 'Колькасць сiмвалаў у поле :attribute павінна быць паміж :min і :max.',
        'array'   => 'Колькасць элементаў у поле :attribute павінна быць паміж :min і :max.',
    ],
    'boolean'              => 'Поле :attribute павінна мець значэнне лагічнага тыпу.',
    'confirmed'            => 'Поле :attribute не супадае з пацвярджэннем.',
    'date'                 => 'Поле :attribute не з\'яўляецца датай.',
    'date_equals'          => 'Поле :attribute павінна быць датай, роўнай :date.',
    'date_format'          => 'Поле :attribute не адпавядае фармату :format.',
    'different'            => 'Палі :attribute і :other павінны адрознівацца.',
    'digits'               => 'Даўжыня лічбавага поля :attribute павінна быць :digits.',
    'digits_between'       => 'Даўжыня лічбавага поля :attribute павінна быць паміж :min і :max.',
    'dimensions'           => 'Поле :attribute мае недапушчальныя памеры выявы.',
    'distinct'             => 'Поле :attribute мае значэнне, якое дублюецца.',
    'email'                => 'Поле :attribute павінна быць сапраўдным электронным адрасам.',
    'ends_with'            => 'Поле :attribute павінна заканчвацца адным з наступных значэнняў: :values.',
    'exists'               => 'Выбранае значэнне для :attribute некарэктна.',
    'file'                 => 'Поле :attribute павінна быць файлам.',
    'filled'               => 'Поле :attribute абавязкова для запаўнення.',
    'gt'                   => [
        'numeric' => 'Поле :attribute павінна быць большым за :value.',
        'file'    => 'Памер файла ў полі :attribute павінен быць большым за :value кілабайт.',
        'string'  => 'Колькасць сiмвалаў у полі :attribute павінна быць большай за :value.',
        'array'   => 'Колькасць элементаў у полі :attribute павінна быць большай за :value.',
    ],
    'gte'                  => [
        'numeric' => 'Поле :attribute павінна быць большым або роўным :value.',
        'file'    => 'Памер файла ў полі :attribute павінен быць большым або роўным :value кілабайт.',
        'string'  => 'Колькасць сiмвалаў у полі :attribute павінна быць большай або роўнай :value.',
        'array'   => 'Колькасць элементаў у полі :attribute павінна быць :value або больш.',
    ],
    'image'                => 'Поле :attribute павінна быць малюнкам.',
    'in'                   => 'Выбранае значэнне для :attribute памылкова.',
    'in_array'             => 'Поле :attribute не існуе ў :other.',
    'integer'              => 'Поле :attribute павінна быць цэлым лікам.',
    'ip'                   => 'Поле :attribute дпавінна быць сапраўдным IP-адрасам.',
    'ipv4'                 => 'Поле :attribute павінна быць сапраўдным IPv4-адрасам.',
    'ipv6'                 => 'Поле :attribute павінна быць сапраўдным IPv6-адрасам.',
    'json'                 => 'Поле :attribute павінна быць JSON радком.',
    'lt'                   => [
        'numeric' => 'Поле :attribute павінна быць меншым за :value.',
        'file'    => 'Памер файла ў полі :attribute павінен быць меншым за :value кілабайт.',
        'string'  => 'Колькасць сiмвалаў у полі :attribute павінна быць меншай за :value.',
        'array'   => 'Колькасць элементаў у полі :attribute павінна быць меншай за :value.',
    ],
    'lte'                  => [
        'numeric' => 'Поле :attribute павінна быць меншым або роўным :value.',
        'file'    => 'Памер файла ў полі :attribute павінен быць меншым або роўным :value кілабайт.',
        'string'  => 'Колькасць сiмвалаў у полі :attribute павінна быць меншай або роўнай :value.',
        'array'   => 'Колькасць элементаў у полі :attribute не павінна перавышаць :value.',
    ],
    'max'                  => [
        'numeric' => 'Поле :attribute не можа быць больш :max.',
        'file'    => 'Памер файла ў поле :attribute не можа быць больш :max кілабайт).',
        'string'  => 'Колькасць сiмвалаў у поле :attribute не можа перавышаць :max.',
        'array'   => 'Колькасць элементаў у поле :attribute не можа перавышаць :max.',
    ],
    'mimes'                => 'Поле :attribute павінна быць файлам аднаго з наступных тыпаў: :values.',
    'mimetypes'            => 'Поле :attribute павінна быць файлам аднаго з наступных тыпаў: :values.',
    'min'                  => [
        'numeric' => 'Поле :attribute павінна быць не менш :min.',
        'file'    => 'Памер файла ў полее :attribute павінен быць не менш :min кілабайт.',
        'string'  => 'Колькасць сiмвалаў у поле :attribute павінна быць не менш :min.',
        'array'   => 'Колькасць элементаў у поле :attribute павінна быць не менш :min.',
    ],
    'not_in'               => 'Выбранае значэнне для :attribute памылкова.',
    'not_regex'            => 'Фармат поля :attribute няправільны.',
    'numeric'              => 'Поле :attribute павінна быць лікам.',
    'password'             => 'Няправільны пароль.',
    'present'              => 'Поле :attribute павінна прысутнічаць.',
    'regex'                => 'Поле :attribute мае памылковы фармат.',
    'required'             => 'Поле :attribute абавязкова для запаўнення.',
    'required_if'          => 'Поле :attribute абавязкова для запаўнення, калі :other раўняецца :value.',
    'required_unless'      => 'Поле :attribute абавязкова для запаўнення, калі :other не раўняецца :values.',
    'required_with'        => 'Поле :attribute абавязкова для запаўнення, калі :values ўказана.',
    'required_with_all'    => 'Поле :attribute абавязкова для запаўнення, калі :values ўказана.',
    'required_without'     => 'Поле :attribute абавязкова для запаўнення, калі :values не ўказана.',
    'required_without_all' => 'Поле :attribute абавязкова для запаўнення, калі ні адно з :values не ўказана.',
    'same'                 => 'Значэнне :attribute павінна супадаць з :other.',
    'size'                 => [
        'numeric' => 'Поле :attribute павінна быць :size.',
        'file'    => 'Размер файла в поле :attribute павінен быць :size кілабайт.',
        'string'  => 'Колькасць сiмвалаў у поле :attribute павінна быць :size.',
        'array'   => 'Колькасць элементаў у поле :attribute павінна быць :size.',
    ],
    'starts_with'          => 'Поле :attribute павінна пачынацца з аднаго з наступных значэнняў: :values.',
    'string'               => 'Поле :attribute павінна быць радком.',
    'timezone'             => 'Поле :attribute павінна быць сапраўдным гадзінным поясам.',
    'unique'               => 'Такое значэнне поля :attribute ўжо існуе.',
    'uploaded'             => 'Не ўдалося загрузіць :attribute.',
    'url'                  => 'Поле :attribute мае памылковы фармат.',
    'uuid'                 => 'Поле :attribute павінна быць сапраўдным UUID.',

    /*
    |--------------------------------------------------------------------------
    | Свае моўныя рэсурсы для праверкі значэнняў
    |--------------------------------------------------------------------------
    |
    | Тут Вы можаце пазначыць свае паведамленні для атрыбутаў.
    | Гэта дазваляе легка паказаць свае паведамленне для зададзенага правіла атрыбуту.
    |
    | http://laravel.com/docs/5.1/validation#custom-error-messages
    | Прыклад выкарыстання
    |
    |   'custom' => [
    |       'email' => [
    |           'required' => 'Нам неабходна ведаць Ваш электронны адрас!',
    |       ],
    |   ],
    |
    */

    'custom' => [
        'attribute-name' => [
            'rule-name' => 'custom-message',
        ],
    ],

    /*
    |--------------------------------------------------------------------------
    | Уласныя назвы атрыбутаў
    |--------------------------------------------------------------------------
    |
    | Наступныя радкі выкарыстоўваюцца для падмены праграмных імёнаў элементаў
    | карыстацкага інтэрфейсу на лёгкачытальныя. Напрыклад, замест імя
    | поля "email" ў паведамленнях будзе выводзіцца "электронны адрас".
    |
    | Прыклад выкарыстання
    |
    |   'attributes' => [
    |       'email' => 'электронны адрас',
    |   ],
    |
    */

    'attributes' => [
    ],
];
